Repository: CarlosSamaniego88/YUSATraders
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: YUSA Traders, expertise and honesty is our signature.
es: YUSA Traders, experiencia y honestidad es nuestro sello de garantía.

source: International Business
es: Mercadeo Internacional

source: YUSA Traders Inc is a leader in the North America meat trade. We supply chicken, turkey, beef and pork products. Our international relationships in the meat industry have allowed us to distribute our products across North America. Under the newly renovated United States, Mexico, Canada agreement (USMCA), we export and import products from the region efficiently, providing our products by leveraging our vast network of suppliers and distributors across the continent.
es: YUSA Traders Inc, es líder en América del Norte en mercadeo de productos cárnicos. Abastecemos de productos frescos y congelados de pollo, pavo, res y cerdo. Nuestras relaciones comerciales internacionales en la industria cárnica nos ha permitido la distribución de nuestros productos en todo América del Norte. Bajo el renovado Tratado de Libre Comercio de América del Norte (TLCAN), exportamos e importamos productos cárnicos de la región de una manera eficiente, tomando ventaja de nuestra red de proveedores y distribuidores en todo el continente.

source: About Us
es: Sobre Nosotros

source: We at YUSA Traders Inc, were founded in 2012, however, our expertise on the meat trade business started since early 1988. Since then, we have lead in the supply and distribution of a variety of meat products in North America. The partnership we have as an authorized agent for
es: YUSA Traders fue creada en el año 2012, sin embargo, nuestra experiencia en el mercadeo de productos cárnicos data desde 1988. Desde entonces, hemos sido lideres en el abasto y distribución de una gran variedad de productos cárnicos en América del Norte. La sociedad que tenemos como agentes autorizados de

source: has allowed us to have a vast credibility and an international reach.
es: , nos ha permitido tener una gran credibilidad en la industria y un liderazgo único a nivel internacional.

source: We truly believe in delivering meat goods efficiently to all our customers. Our strategy to reach our goals consists on high-quality products, efficient transportation, and the right logistical strategy. The market continuance and the outcome of a satisfied customer is the result of collaboration and personal communication between all of our suppliers, distributors and associates in the region.
es: Creemos fielmente en el abasto eficiente de cárnicos a nuestros clientes. Nuestra estrategia para alcanzar nuestro objetivo, son los productos de alta calidad, aunado a un sistema de transporte en tiempo, y las estrategias de logística aplicadas adecuadamente. La permanencia en el mercado y satisfacción de nuestros clientes son el resultado de la colaboración y la comunicación personalizada y constante con nuestros proveedores, distribuidores y asociados en la región.

source: YUSA Traders Inc, expertise and honesty is our signature.
es: YUSA Traders. Experiencia y honestidad son nuestro sello de garantía.

source: Our Products
es: Nuestros Productos

source: Chicken
es: Pollo

source: Chicken items are our most highly demanded products. We supply various chicken related items, including but not limited to chicken leg quarters, drums, miscut wings, chicken breast, a variety of breast trimmings, gizzards, and whole chickens.
es: Los productos de pollo son los que tienen mayor demanda en nuestro negocio. Algunos ejemplos de los productos que abastecemos son, pierna y muslo, pierna bate, alas número 2, pechuga, una gama amplia de recortes, mollejas, pollo entero entre otros.

source: Pork
es: Cerdo

source: Our key products in this category include, but is not limited to multiple types of pork cuts, such as pork carcasses, bone in hams, hearts, stomachs, loins, front and hind feet, bellies, fresh and frozen skins, neckbones, and trimmings.
es: Nuestra categoría de productos claves de cerdo incluyen canales frescos cortados en secciones, pierna con hueso y cuero, corazón, buche, lomo, manitas y patitas, tocinos, cueros frescos y congelados, espinazo, recortes.

source: Turkey
es: Pavo

source: Our turkey product line includes but is not limited to fresh or frozen whole turkeys, drumsticks, tails, and necks.
es: Los productos de pavo que manejamos pueden ser fresco y congelado, tales como pavos enteros, pierna bate, colas, pescuezos entre otros.

source: Beef
es: Res

source: We supply various beef items, including but not limited to tripe, livers, hearts, feet, kidneys, small intestines, cheek meat, head meat, and beef trimmings.
es: En los productos de res, abastecemos productos como el menudo, higado, corazón, patas, riñon, tripas, cachete, carne de cabeza, recortes entre otros.

source: Contact Us
es: Contáctenos

source: Language
es: Idioma

source: English
es: Inglés

source: Spanish
es: Español

source: Back to top
es: Volver Arriba

source: Copyright
es: Aviso de Copyright
